# Вывести на экран числа от -N до N
def countN(a):
    for n in range(-a,a+1):
        print(n)

countN(5)